// @strict-types

#Область ПрограммныйИнтерфейс

// Функция возвращает массив имен реквизтов документа.
// 
// Параметры:
// 	МассивИменРеквизитов - Массив из Строка
//
// Возвращаемое значение:
//	Массив из Строка
//
Функция ПолучитьРеквизитыДокумента(МассивИменРеквизитов) Экспорт
	
	ОчиститьМассивРеквизитов(МассивИменРеквизитов);
	
	РеквизитыДокумента = Метаданные.Документы.Документ.Реквизиты;
	Для Каждого Реквизит Из РеквизитыДокумента Цикл
		МассивИменРеквизитов.Добавить(Реквизит.Имя);
	КонецЦикла;	
		
	Возврат МассивИменРеквизитов;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает массив имен реквизтов документа.
// 
// Параметры:
// 	МассивИменРеквизитов - Массив из Строка
//
Процедура ОчиститьМассивРеквизитов(МассивИменРеквизитов)

	МассивИменРеквизитов.Очистить();
	
КонецПроцедуры

#КонецОбласти